app/controllers/post_controller.rb

  def create
    @post = Post.new(postname: params[:postname],
    picturename: params[:picturename],
    picture: nil)

    if @post.save && params[:picture]
---
INSERT INTO "posts" ("postname", "picturename", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["postname", "aa"], ["picturename", "aa"], ["picture", nil], ["created_at", "2023-09-30 02:21:48.772969"], ["updated_at", "2023-09-30 02:21:48.772969"]]