app/controllers/share_controller.rb

  def share
    @pictures = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    @post_show = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def search
    @searches = Post.where(picturename: params[:search])
---
SELECT "posts".* FROM "posts" WHERE "posts"."picturename" IS NULL LIMIT ?  [["LIMIT", 1]]