app/controllers/share_controller.rb

  def search
    if params[:select] == "ニックネーム"
      @searches = Post.where("postname like ?", "%#{params[:search]}%").order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."postname LIKE?" = ? ORDER BY "posts"."created_at" DESC  [["postname LIKE?", "どらごん"]]